DuyTrandeLion/ble-terrarium/Project-nRF52840/main.c
    err_code = ble_ans_c_enable_notif_new_alert(&m_ans_c);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("New Alert State: Enabled.");

    err_code = ble_ans_c_enable_notif_unread_alert(&m_ans_c);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Unread Alert State: Enabled.");

    err_code = ble_ans_c_unread_alert_notify(&m_ans_c, ANS_TYPE_ALL_ALERTS);
    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_HANDLER(err_code);
    }
    NRF_LOG_INFO("Notify the Unread Alert characteristic for all categories.");

//    err_code = ble_ans_c_new_alert_notify(&m_ans_c, ANS_TYPE_ALL_ALERTS);
//    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
//    {
//        APP_ERROR_HANDLER(err_code);
//    }
//    NRF_LOG_INFO("Notify the New Alert characteristic for all categories.");

    NRF_LOG_DEBUG("Notifications enabled.");
}


/**@brief Function for setup of alert notifications in central.
 *
 * @details This function will be called when supported alert notification and
 *          supported unread alert notifications has been fetched.
 *
 * @param[in] p_evt  Event containing the response with supported alert types.
 */
static void control_point_setup(ble_ans_c_evt_t * p_evt)
{
    uint32_t                err_code;
    ble_ans_control_point_t setting;

    if (p_evt->uuid.uuid == BLE_UUID_SUPPORTED_UNREAD_ALERT_CATEGORY_CHAR)
    {
        setting.command  = ANS_ENABLE_UNREAD_CATEGORY_STATUS_NOTIFICATION;
        setting.category = (ble_ans_category_id_t)p_evt->data.alert.alert_category;
        NRF_LOG_DEBUG("Unread status notification enabled for received categories.");
    }
    else if (p_evt->uuid.uuid == BLE_UUID_SUPPORTED_NEW_ALERT_CATEGORY_CHAR)
    {
        setting.command  = ANS_ENABLE_NEW_INCOMING_ALERT_NOTIFICATION;
        setting.category = (ble_ans_category_id_t)p_evt->data.alert.alert_category;
        NRF_LOG_DEBUG("New incoming notification enabled for received categories.");
    }
    else
    {
        return;
    }

    err_code = ble_ans_c_control_point_write(&m_ans_c, &setting);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for reading supported alert notifications in central.
 *
 * @details This function will be called when a connection has been established.
 */
static void supported_alert_notification_read(void)
{
    NRF_LOG_DEBUG("Read supported Alert Notification characteristics on the connected peer.");

    ret_code_t err_code;

    err_code = ble_ans_c_new_alert_read(&m_ans_c);
    APP_ERROR_CHECK(err_code);

    err_code = ble_ans_c_unread_alert_read(&m_ans_c);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for lighting up the LED corresponding to the notification received.
 *
 * @param[in]   p_evt   Event containing the notification.
 */
static void handle_alert_notification(ble_ans_c_evt_t * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->uuid.uuid)
    {
        case BLE_UUID_UNREAD_ALERT_CHAR:
        {
            err_code = bsp_indication_set(BSP_INDICATE_ALERT_1);
            NRF_LOG_INFO("New Unread Alert:");
            NRF_LOG_INFO("  Category:                 %s",
                         (uint32_t)lit_catid[p_evt->data.alert.alert_category]);
            NRF_LOG_INFO("  Number of unread alerts:  %d",
                         p_evt->data.alert.alert_category_count);

            oled_set_unread_noti(lit_catid[p_evt->data.alert.alert_category],
                                 p_evt->data.alert.alert_category_count);
            break;
        }

        case BLE_UUID_NEW_ALERT_CHAR:
        {
            err_code = bsp_indication_set(BSP_INDICATE_ALERT_0);
            NRF_LOG_INFO("New Alert:");
            NRF_LOG_INFO("  Category:                 %s",
                         (uint32_t)lit_catid[p_evt->data.alert.alert_category]);
            NRF_LOG_INFO("  Number of new alerts:     %d",
                         p_evt->data.alert.alert_category_count);
            NRF_LOG_INFO("  Text String Information:  %s",
                         (uint32_t)p_evt->data.alert.p_alert_msg_buf);

            oled_set_new_noti(lit_catid[p_evt->data.alert.alert_category],
                              p_evt->data.alert.p_alert_msg_buf,
                              p_evt->data.alert.alert_category_count);
            break;
        }

        default:
        {
            // Only Unread and New Alerts exists, thus do nothing.
            break;
        }
    }

    m_display_screen_select = NOTI_0;
    m_screen_timeout = 0;
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


static void update_time(ble_date_time_t * p_time)
{
    if (NULL != p_time)
    {
        UBXGNSS_GET_DATE(GNSS_DEV, p_time->year, p_time->month, p_time->day);
        UBXGNSS_GET_TIME(GNSS_DEV, p_time->hours, p_time->minutes, p_time->seconds);
    }
}


static void navigation_update(void)
{
    m_navigation.position_status = (0 != UBXGNSS_GET_FIX(GNSS_DEV))? BLE_LNS_POSITION_OK : BLE_LNS_NO_POSITION;
    m_navigation.waypoint_reached    = !m_navigation.waypoint_reached;
    m_navigation.destination_reached = !m_navigation.destination_reached;
    m_navigation.bearing++;
  
    m_navigation.heading = m_ecompass_heading * 100;

    update_time(&m_navigation.eta);
}


static void position_quality_update(void)
{
    m_position_quality.position_status = (0 != UBXGNSS_GET_FIX(GNSS_DEV))? BLE_LNS_POSITION_OK : BLE_LNS_NO_POSITION;
    m_position_quality.number_of_satellites_in_solution = UBXGNSS_GET_SATS_IN_USE(GNSS_DEV);
    m_position_quality.number_of_satellites_in_view = UBXGNSS_GET_SATS_IN_VIEW(GNSS_DEV);
    m_position_quality.time_to_first_fix = (UBXGNSS_GET_TIME_TO_FIRST_FIX(GNSS_DEV) / 1000) * 10;
    m_position_quality.hdop = (UBXGNSS_GET_H_DILUTION(GNSS_DEV) * 10);
    m_position_quality.vdop = (UBXGNSS_GET_V_DILUTION(GNSS_DEV) * 10);
}


