DuyTrandeLion/ble-terrarium/Project-nRF52840/main.c
/**@brief Provide simulated location and speed.
 */
static void loc_speed_update(void)
{
    float elevation;

    m_location_speed.position_status = (0 != UBXGNSS_GET_FIX(GNSS_DEV))? BLE_LNS_POSITION_OK : BLE_LNS_NO_POSITION;
    m_location_speed.data_format = ((2 == UBXGNSS_GET_FIX_MODE(GNSS_DEV))? BLE_LNS_SPEED_DISTANCE_FORMAT_2D :
                                    (3 == UBXGNSS_GET_FIX_MODE(GNSS_DEV))? BLE_LNS_SPEED_DISTANCE_FORMAT_3D : BLE_LNS_SPEED_DISTANCE_FORMAT_2D);
    m_location_speed.latitude = (UBXGNSS_GET_LATITUDE(GNSS_DEV) * 10000000);
    m_location_speed.longitude = (UBXGNSS_GET_LONGITUDE(GNSS_DEV) * 10000000);

    if (BLE_LNS_ELEV_SOURCE_POSITIONING_SYSTEM == m_location_speed.elevation_source)
    {
        m_location_speed.elevation = (UBXGNSS_GET_ALTITUDE(GNSS_DEV) * 100);
    }
    else if (BLE_LNS_ELEV_SOURCE_BAROMETRIC == m_location_speed.elevation_source)
    {
        barometer_get_altitude(&elevation);
        m_location_speed.elevation = (uint32_t)(elevation * 100);
    }
//    m_location_speed.instant_speed = (UBXGNSS_GET_INSTANT_SPEED(GNSS_DEV, lwgps_speed_mph) * 10);

    /* Read from sensors */
    ecompass_read_heading(&m_ecompass_heading);

    m_location_speed.heading = m_ecompass_heading * 100;

    if (TRAVEL_STARTED == m_travelling_status)
    {
        m_location_speed.rolling_time++;
    }

    update_time(&m_location_speed.utc_time);
}


static void general_timer_handler(void)
{
    if (0xFFFF != m_screen_timeout)
    {
        m_screen_timeout++;
    }

    if ((m_screen_timeout >= SCREEN_TIMEOUT_PERIOD) && (0xFFFF != m_screen_timeout))
    {
        m_screen_timeout = 0xFFFF;
        m_display_screen_select = NAVIGATION_0;
    }
}


/**@brief Location and navigation time-out handler.
 *
 * @details This function will be called each time the location and navigation measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the time-out handler.
 */
static void lns_timeout_handler(void)
{
    ret_code_t err_code;

    loc_speed_update();
    position_quality_update();
    navigation_update();

    err_code = ble_lns_loc_speed_send(&m_lns);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }

    err_code = ble_lns_navigation_send(&m_lns);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
    
    ecompass_read_calibration_status(&m_accel_calib_status, &m_gyro_calib_status, &m_mag_calib_status, m_system_calib_status);
    oled_set_calib_status(m_accel_calib_status, m_gyro_calib_status, m_mag_calib_status, m_system_calib_status);
    oled_navigation_screen(&m_lns, m_display_screen_select);
}


/**@brief Function for handling the Alert Notification Service Client.
 *
 * @details This function will be called for all events in the Alert Notification Client which
 *          are passed to the application.
 *
 * @param[in]   p_evt   Event received from the Alert Notification Service Client.
 */
static void on_ans_c_evt(ble_ans_c_evt_t * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_type)
    {
        case BLE_ANS_C_EVT_NOTIFICATION:
            handle_alert_notification(p_evt);
            NRF_LOG_DEBUG("Alert Notification received from server, UUID: %X.", p_evt->uuid.uuid);
            break; // BLE_ANS_C_EVT_NOTIFICATION

        case BLE_ANS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG_DEBUG("Alert Notification Service discovered on the server.");
            err_code = ble_ans_c_handles_assign(&m_ans_c,
                                                p_evt->conn_handle,
                                                &p_evt->data.service);
            APP_ERROR_CHECK(err_code);
            supported_alert_notification_read();
            alert_notification_setup();
            break; // BLE_ANS_C_EVT_DISCOVERY_COMPLETE

        case BLE_ANS_C_EVT_READ_RESP:
            NRF_LOG_DEBUG("Alert Setup received from server, UUID: %X.", p_evt->uuid.uuid);
            control_point_setup(p_evt);
            break; // BLE_ANS_C_EVT_READ_RESP

        case BLE_ANS_C_EVT_DISCONN_COMPLETE:
            err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
            APP_ERROR_CHECK(err_code);
            break; // BLE_ANS_C_EVT_DISCONN_COMPLETE

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_DISP);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


